### The Anatomy Of A Dataframe
![Dataframe Anatomy](../images/dataframe-anatomy.png)

### pandas is a python library for working with dataframes
- get familiar with using the [API reference](https://pandas.pydata.org/pandas-docs/stable/reference/index.html#api), which gives information about the many objects, functions and methods for working with dataframes and series

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

### Let's explore these pandas methods, attributes, and accessors
 - read_csv( )
 * .shape
 - .head( )
 * .tail( )
 - .columns
 - .drop( )
 - .rename( )
 - .query( )
 - .loc[ ]
 - .iloc[ ]
 - [[ ]]

### Read in the schools data, a CSV file, and examine the shape, head, and tail

In [2]:
schools = pd.read_csv('../data/schools_clean.csv')
schools.head(2)

,level,name,zipcode,grade_k,grade_1,grade_2,grade_3,grade_4,grade_5,grade_6,...,hisp,p_islander,white,male,female,econ_disadv,disabled,limited_eng,lat,lng
0,Elementary School,A. Z. Kelley Elementary,37013,153.0,145.0,149.0,180.0,184.0,NaN,NaN,...,206,1.0,212.0,431,421,261,75.0,298.0,36.021817,-86.658848
1,Elementary School,Alex Green Elementary,37189,42.0,50.0,44.0,38.0,24.0,NaN,NaN,...,29,1.0,21.0,115,119,153,21.0,25.0,36.252961,-86.832229

In [4]:
schools.tail(2)

,level,name,zipcode,grade_k,grade_1,grade_2,grade_3,grade_4,grade_5,grade_6,...,hisp,p_islander,white,male,female,econ_disadv,disabled,limited_eng,lat,lng
165,Middle School,William Henry Oliver Middle,37211,NaN,NaN,NaN,NaN,NaN,231.0,271.0,...,158,3.0,437.0,487,498,252,112.0,231.0,36.020174,-86.712207
166,Middle School,Wright Middle,37211,NaN,NaN,NaN,NaN,NaN,188.0,216.0,...,534,1.0,104.0,443,367,400,75.0,536.0,36.100109,-86.734133

In [5]:
schools.shape

(167, 29)

#### the `columns` attribute shows the column names for the DataFrame

In [6]:
schools.columns

Index(['level', 'name', 'zipcode', 'grade_k', 'grade_1', 'grade_2', 'grade_3',
       'grade_4', 'grade_5', 'grade_6', 'grade_7', 'grade_8', 'grade_9',
       'grade_10', 'grade_11', 'grade_12', 'native_amer', 'asian', 'black',
       'hisp', 'p_islander', 'white', 'male', 'female', 'econ_disadv',
       'disabled', 'limited_eng', 'lat', 'lng'],
      dtype='object')

#### The `iloc[ ]` accessor gets the specified rows and columns by their _index_ values

In [7]:
first_five = schools.iloc[0:5, 0:2]

In [8]:
first_five

               level                       name
0  Elementary School    A. Z. Kelley Elementary
1  Elementary School      Alex Green Elementary
2  Elementary School           Amqui Elementary
3  Elementary School  Andrew Jackson Elementary
4        High School        Antioch High School

#### The `loc[ ]` accessor gets the specified rows and columns by their _names_

In [9]:
middle_schools = schools.loc[schools['level'] == 'Middle School'].head()
middle_schools.shape

(5, 29)

In [ ]:
middle_schools.head()

#### The `.query( )` method uses an expression to subset the DataFrame

In [ ]:
econ_disadv_over_200 = schools.query('econ_disadv > 200')
econ_disadv_over_200.shape

#### Use `@` before the variable name to reference an external object in the query expression

In [ ]:
my_list = ['37201', '37203']
downtown_schools = schools.query("zipcode in @my_list")
downtown_schools.shape

In [ ]:
school_and_type = schools[['name', 'level']]
school_and_type.head(2)

#### Drop columns from a DataFrame with the `.drop( )` method; be sure to specify `columns = ` and pass a list of columns to the method

In [ ]:
schools.columns

In [ ]:
school_and_gender_counts = schools.drop(columns = ['native_amer', 'asian', 'black', 'hisp', 'p_islander', 'white', 
                                              'econ_disadv', 'disabled', 'limited_eng', 'lat', 'lng'])

In [ ]:
school_and_gender_counts.columns

#### If the column list is short and you are feeling lazy, you can assign new column names (as a list _with every column in the right order_ ) to the columns attribute

In [ ]:
school_and_type.columns

In [ ]:
school_and_type.columns = ['school', 'type']
school_and_type.head()

#### If you only want to change the name of a subset of columns, use the df.rename() function

In [ ]:
school_and_gender_counts = school_and_gender_counts.rename(columns = {'level': 'type', 'name': 'school'})
school_and_gender_counts.head()

In [ ]:
%who